///////////////////////////////////////////////////////////////////////////////
///
/// Copyright (c) 2011 - <company name here>
///
/// Original filename: KernelInject.h
/// Project          : KernelInject
/// Date of creation : <see KernelInject.c>
/// Author(s)        : <see KernelInject.c>
///
/// Purpose          : <see KernelInject.c>
///
/// Revisions:         <see KernelInject.c>
///
///////////////////////////////////////////////////////////////////////////////

// $Id$

#ifndef __KERNELINJECT_H_VERSION__
#define __KERNELINJECT_H_VERSION__ 100

#if defined(_MSC_VER) && (_MSC_VER >= 1020)
#pragma once
#endif


#include "drvcommon.h"
#include "drvversion.h"

#define DEVICE_NAME			"\\Device\\KERNELINJECT_DeviceName"
#define SYMLINK_NAME		"\\DosDevices\\KERNELINJECT_DeviceName"
PRESET_UNICODE_STRING(usDeviceName, DEVICE_NAME);
PRESET_UNICODE_STRING(usSymlinkName, SYMLINK_NAME);

#ifndef FILE_DEVICE_KERNELINJECT
#define FILE_DEVICE_KERNELINJECT 0x8000
#endif

// Values defined for "Method"
// METHOD_BUFFERED
// METHOD_IN_DIRECT
// METHOD_OUT_DIRECT
// METHOD_NEITHER
// 
// Values defined for "Access"
// FILE_ANY_ACCESS
// FILE_READ_ACCESS
// FILE_WRITE_ACCESS


NTSYSAPI
NTSTATUS
NTAPI ZwPulseEvent( HANDLE h, PULONG p );

NTSYSAPI NTSTATUS NTAPI 
ZwQueryInformationProcess(
	__in       HANDLE ProcessHandle,
	__in       PROCESSINFOCLASS ProcessInformationClass,
	__out      PVOID ProcessInformation,
	__in       ULONG ProcessInformationLength,
	__out_opt  PULONG ReturnLength

	0xFF, 0xC0, 0xFC, 0x03, 0xFF, 0xC0, 0x7E, 0x01, 0xFF, 0xE0, 0x3E, 0x0F, 0x00, 0x00, 0x3F, 0x07, 
	0x00, 0x00, 0x3F, 0x03, 0x00, 0x00, 0x3F, 0x81, 0x00, 0x00, 0x3F, 0xC0, 0x00, 0x00, 0x3F, 0xC1, 
	0x00, 0x00, 0x3F, 0xE3, 0xFF, 0xFF, 0xFF, 0xF7, 0x26, 0x3D, 0x4F, 0x38, 0xC2, 0x82, 0x37, 0xB8, 
	0xF3, 0x24, 0x42, 0x03, 0x17, 0x9B, 0x3A, 0x83, 0x01, 0x00, 0x00, 0x8C, 0x00, 0x00, 0x00, 0x00, 
	0x05, 0x00, 0x00, 0x00, 0x01, 0x29, 0x73, 0x75, 0x64, 0x61, 0x6D, 0x69, 0x00, 0x10, 0x55, 0x54, 
	0x79, 0x70, 0x65, 0x73, 0x00, 0x00, 0xC7, 0x53, 0x79, 0x73, 0x74, 0x65, 0x6D, 0x00, 0x00, 0x81, 
	0x53, 0x79, 0x73, 0x49, 0x6E, 0x69, 0x74, 0x00, 0x0C, 0x4B, 0x57, 0x69, 0x6E, 0x64, 0x6F, 0x77, 
	0x73, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x01, 0x00, 0x20, 0x20, 0x04, 0x00, 0x01, 0x00, 
	0x04, 0x00, 0xE8, 0x02, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

typedef struct _MyWriteMem{
	ULONG Unknow[4];
	IMAGE_DATA_DIRECTORY ExportDataDirectory[1];
	ULONG DataDirectory1_VirtualAddress;
	ULONG DataDirectory11_VirtualAddress;
	ULONG DataDirectory11_size;
	ULONG DataDirectory12_VirtualAddress;
	ULONG DataDirectory12_size;
	ULONG DataDirectory14_VirtualAddress;
	ULONG DataDirectory14_size;
	ULONG reserve;
	PIMAGE_IMPORT_DESCRIPTOR IMPORT_mscoree;
	PIMAGE_IMPORT_DESCRIPTOR IMPORT_msvcm80;
	PIMAGE_IMPORT_DESCRIPTOR IMPORT_msvcm90;
	IMAGE_IMPORT_BY_NAME IMPORT_BY_NAME;
	UCHAR Unknow2[14];
	PVOID IMPORT_BY_NAME_offset;
	ULONG Unknow3;
	ULONG Unknow4;
	ULONG Unknow5;
	PVOID Viruaddress58h;
	ULONG Unknow6;
	ULONG Unknow7;
	PVOID dllnameoffset;
	PVOID Unknow9;
	PIMAGE_IMPORT_DESCRIPTOR IMPORT_DESCRIPTOR;

}WriteMem,*PWriteMem;


typedef struct _XPEB { // Size: 0x1D8
	/*000*/ UCHAR InheritedAddressSpace;
	/*001*/ UCHAR ReadImageFileExecOptions;
	/*002*/ UCHAR BeingDebugged;
	/*003*/ UCHAR SpareBool; // Allocation size
	/*004*/ HANDLE Mutant;
	/*008*/ HINSTANCE ImageBaseAddress; // Instance
	/*00C*/ VOID *DllList;
	/*010*/ PVOID ProcessParameters;
	/*014*/ ULONG SubSystemData;
	/*018*/ HANDLE DefaultHeap;
	/*01C*/ KSPIN_LOCK FastPebLock;
	/*020*/ ULONG FastPebLockRoutine;
	/*024*/ ULONG FastPebUnlockRoutine;
	/*028*/ ULONG EnvironmentUpdateCount;
	/*02C*/ ULONG KernelCallbackTable;
	/*030*/ LARGE_INTEGER SystemReserved;
	/*038*/ ULONG FreeList;
	/*03C*/ ULONG TlsExpansionCounter;
	/*040*/ ULONG TlsBitmap;
	/*044*/ LARGE_INTEGER TlsBitmapBits;
	/*04C*/ ULONG ReadOnlySharedMemoryBase;
	/*050*/ ULONG ReadOnlySharedMemoryHeap;
	/*054*/ ULONG ReadOnlyStaticServerData;
	/*058*/ ULONG AnsiCodePageData;
	/*05C*/ ULONG OemCodePageData;
	/*060*/ ULONG UnicodeCaseTableData;
	/*064*/ ULONG NumberOfProcessors;
	/*068*/ LARGE_INTEGER NtGlobalFlagx; // Address of a local copy
	/*070*/ LARGE_INTEGER CriticalSectionTimeout;
	/*078*/ ULONG HeapSegmentReserve;
	/*07C*/ ULONG HeapSegmentCommit;
	/*080*/ ULONG HeapDeCommitTotalFreeThreshold;
	/*084*/ ULONG HeapDeCommitFreeBlockThreshold;
	/*088*/ ULONG NumberOfHeaps;
	/*08C*/ ULONG MaximumNumberOfHeaps;
	/*090*/ ULONG ProcessHeaps;
	/*094*/ ULONG GdiSharedHandleTable;
	/*098*/ ULONG ProcessStarterHelper;
	/*09C*/ ULONG GdiDCAttributeList;
	/*0A0*/ KSPIN_LOCK LoaderLock;
	/*0A4*/ ULONG OSMajorVersion;
	/*0A8*/ ULONG OSMinorVersion;
	/*0AC*/ USHORT OSBuildNumber;
	/*0AE*/ USHORT OSCSDVersion;
	/*0B0*/ ULONG OSPlatformId;
	/*0B4*/ ULONG ImageSubsystem;
	/*0B8*/ ULONG ImageSubsystemMajorVersion;
	/*0BC*/ ULONG ImageSubsystemMinorVersion;
	/*0C0*/ ULONG ImageProcessAffinityMask;
	/*0C4*/ ULONG GdiHandleBuffer[0x22];
	/*14C*/ ULONG PostProcessInitRoutine;
	/*150*/ ULONG TlsExpansionBitmap;
	/*154*/ UCHAR TlsExpansionBitmapBits[0x80];
	/*1D4*/ ULONG SessionId;
} MYPEB, *PMyPEB;
#endif // __KERNELINJECT_H_VERSION__
